Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/fedora-tm.tmx
Source language: en
Languages: ca_es

source: <emphasis>allow</emphasis> = The server certificate is requested. If no certificate is provided, the session proceeds normally. If a bad certificate is provided, it will be ignored and the session proceeds normally.
ca_es: <emphasis>allow</emphasis> = El certificat del servidor es sol·licitatarà. Si no es proporciona cap certificat, la sessió avança normalment. Si es proporciona un certificat dolent, s'ignorarà i la sessió procedirà normalment.

source: <emphasis>try</emphasis> = The server certificate is requested. If no certificate is provided, the session proceeds normally. If a bad certificate is provided, the session is immediately terminated.
ca_es: <emphasis>try</emphasis> = El certificat del servidor es sol·licitatarà. Si no es proporciona cap certificat, la sessió avança normalment. Si es proporciona un certificat dolent, immediatament s'acaba la sessió.

source: <emphasis>demand</emphasis> = The server certificate is requested. If no certificate is provided, or a bad certificate is provided, the session is immediately terminated.
ca_es: <emphasis>demand</emphasis> = El certificat del servidor es sol·licitatarà. Si no es proporciona cap certificat, o se'n proporciona un de dolent, immediatament s'acaba la sessió.

source: <emphasis>hard</emphasis> = Same as <quote>demand</quote>
ca_es: <emphasis>hard</emphasis> = Igual que <quote>demand</quote>

source: Default: hard
ca_es: Per defecte: hard

source: ldap_tls_cacert (string)
ca_es: ldap_tls_cacert (cadena)

source: Specifies the file that contains certificates for all of the Certificate Authorities that <command>sssd</command> will recognize.
ca_es: Especifica el fitxer que conté els certificats per a totes les Autoritats de Certificació que reconeixerà l'<command>sssd</command>.

source: Default: use OpenLDAP defaults, typically in <filename>/etc/openldap/ldap.conf</filename>
ca_es: Per defecte: Utilitza els valors per defecte d'OpenLDAP, normalment a <filename>/etc/openldap/ldap.conf</filename>

source: ldap_tls_cacertdir (string)
ca_es: ldap_tls_cacertdir (cadena)

source: Specifies the path of a directory that contains Certificate Authority certificates in separate individual files. Typically the file names need to be the hash of the certificate followed by '.0'. If available, <command>cacertdir_rehash</command> can be used to create the correct names.
ca_es: Especifica la ruta d'un directori que conté els certificats d'Entitat Certificadora en arxius separats independents. Normalment els noms de fitxer són el hash del certificat seguit de '. 0 ". Si està disponible, <command>cacertdir_rehash</command> pot ser utilitzat per crear els noms correctes.

source: ldap_id_use_start_tls (boolean)
ca_es: ldap_id_use_start_tls (booleà)

source: Specifies that the id_provider connection must also use <systemitem class="protocol">tls</systemitem> to protect the channel.
ca_es: Especifica que la connexió id_provider també ha d'utilitzar <systemitem class="protocol">tls</systemitem> per a protegir el canal.

source: ldap_sasl_mech (string)
ca_es: ldap_sasl_mech (cadena)

source: Specify the SASL mechanism to use. Currently only GSSAPI is tested and supported.
ca_es: Especifica el mecanisme SASL a utilitzar. Actualment només GSSAPI és provat i suportat.

source: ldap_sasl_authid (string)
ca_es: ldap_sasl_authid (cadena)

source: ldap_krb5_keytab (string)
ca_es: ldap_krb5_keytab (cadena)

source: Specify the keytab to use when using SASL/GSSAPI.
ca_es: Especifica el fitxer keytab a utilitzar quan s'utilitza SASL/GSSAPI.

source: Default: System keytab, normally <filename>/etc/krb5.keytab</filename>
ca_es: Per defecte: Fitxer keytab de sistema, normalment <filename>/etc/krb5.keytab</filename>

source: ldap_krb5_init_creds (boolean)
ca_es: ldap_krb5_init_creds (booleà)

source: Specifies that the id_provider should init Kerberos credentials (TGT). This action is performed only if SASL is used and the mechanism selected is GSSAPI.
ca_es: Especifica que el id_provider hauria d'iniciar les credencials del Kerberos (TGT). Aquesta acció es realitza només si s'utilitza SASL i el mecanisme seleccionat és GSSAPI.

source: ldap_krb5_ticket_lifetime (integer)
ca_es: ldap_krb5_ticket_lifetime (enter)

source: Specifies the lifetime in seconds of the TGT if GSSAPI is used.
ca_es: Especifica el temps de vida en segons de la TGT si s'utilitza GSSAPI.

source: Default: 86400 (24 hours)
ca_es: Per defecte: 86400 (24 hores)

source: When using service discovery for KDC or kpasswd servers, SSSD first searches for DNS entries that specify _udp as the protocol and falls back to _tcp if none are found.
ca_es: En utilitzar el servei de descobriment per a servidors KDC o kpasswd, l'SSSD primer cerca les entrades DNS que especifiquen _udp com el protocol i retorna a _tcp si no se'n troba cap.

source: This option was named <quote>krb5_kdcip</quote> in earlier releases of SSSD. While the legacy name is recognized for the time being, users are advised to migrate their config files to use <quote>krb5_server</quote> instead.
ca_es: Aquesta opció s'anomenava <quote>krb5_kdcip</quote> en les primeres versions d'SSSD. Mentre que el nom antic és reconegut de moment, s'aconsella als usuaris que migrain els seus fitxers de configuració per utilitzar <quote>krb5_server</quote>.

source: krb5_realm (string)
ca_es: krb5_realm (cadena)

source: Specify the Kerberos REALM (for SASL/GSSAPI auth).
ca_es: Especifica l'àmbit KERBEROS (per a autenticació SASL/GSSAPI).

source: Default: System defaults, see <filename>/etc/krb5.conf</filename>
ca_es: Per defecte: Paràmetres predeterminats del sistema, vegeu <filename>/etc/krb5.conf</filename>

source: ldap_pwd_policy (string)
ca_es: ldap_pwd_policy (cadena)

source: Select the policy to evaluate the password expiration on the client side. The following values are allowed:
ca_es: Selecciona la política per avaluar la caducitat de la contrasenya en el costat del client. S'admeten els valors següents:

source: <emphasis>none</emphasis> - No evaluation on the client side. This option cannot disable server-side password policies.
ca_es: <emphasis>none</emphasis> - Cap avaluació del costat del client. Aquesta opció no inhabilita les polítiques de contrasenya de servidor.

source: <emphasis>mit_kerberos</emphasis> - Use the attributes used by MIT Kerberos to determine if the password has expired. Use chpass_provider=krb5 to update these attributes when the password is changed.
ca_es: <emphasis>mit_kerberos</emphasis> - Usa els atributs utilitzats per MIT Kerberos per determinar si la contrasenya ha caducat. Utilitza chpass_provider=krb5 per actualitzar aquests atributs quan es canvia la contrasenya.

source: Default: none
ca_es: Per defecte: none

source: ldap_referrals (boolean)
ca_es: ldap_referrals (booleà)

source: Specifies whether automatic referral chasing should be enabled.
ca_es: Especifica si el seguiment automàtic del referenciador s'hauria d'habilitar.

source: Please note that sssd only supports referral chasing when it is compiled with OpenLDAP version 2.4.13 or higher.
ca_es: Si us plau fixi's que l'sssd només suporta el seguiment del referenciador quan és compilat amb la versió d'OpenLDAP 2.4.13 o superior.

source: ldap_dns_service_name (string)
ca_es: ldap_dns_service_name (cadena)

source: Specifies the service name to use when service discovery is enabled.
ca_es: Especifica el nom de servei per utilitzar quan està habilitada la detecció de serveis.

source: Default: ldap
ca_es: Per defecte: ldap

source: ldap_chpass_dns_service_name (string)
ca_es: ldap_chpass_dns_service_name (cadena)

source: Specifies the service name to use to find an LDAP server which allows password changes when service discovery is enabled.
ca_es: Especifica el nom de servei a utilitzar per trobar un servidor LDAP que permet canvis de contrasenya quan està habilitada la detecció de serveis.

source: Default: not set, i.e. service discovery is disabled
ca_es: Defecte: no definit, és a dir, el descobriment de serveis està inhabilitat

source: ldap_access_filter (string)
ca_es: ldap_access_filter (cadena)

source: Example:
ca_es: Exemple:

source: This example means that access to this host is restricted to members of the "allowedusers" group in ldap.
ca_es: Aquest exemple significa que l'accés a aquesta màquina està restringit als membres del grup d'ldap "allowedusers".

source: Offline caching for this feature is limited to determining whether the user's last online login was granted access permission. If they were granted access during their last login, they will continue to be granted access while offline and vice-versa.
ca_es: La memòria cau fora de línia per a aquesta característica es limita a determinar si el darrer inici de sessió d'usuari va concedir permís d'accés. Si es var concedir accés durant el seu últim inici de sessió, es continuarà concedint accés en estar fora de línia i viceversa.

source: Default: Empty
ca_es: Per defecte: Buit

source: ldap_account_expire_policy (string)
ca_es: ldap_account_expire_policy (cadena)

source: With this option a client side evaluation of access control attributes can be enabled.
ca_es: Amb aquesta opció es pot habilitar una avaluació del costat de client d'atributs de control d'accés.

source: Please note that it is always recommended to use server side access control, i.e. the LDAP server should deny the bind request with a suitable error code even if the password is correct.
ca_es: Si us plau, tingueu en compte que sempre és recomanable utilitzar el control d'accés del costat de servidor, és a dir, el servidor d'LDAP hauria de denegar la petició de vincle amb un codi d'error adequat fins i tot si la contrasenya és correcta.

source: The following values are allowed:
ca_es: S'admeten els valors següents:

source: <emphasis>shadow</emphasis>: use the value of ldap_user_shadow_expire to determine if the account is expired.
ca_es: <emphasis>shadow</emphasis>: utilitza el valor ldap_user_shadow_expire per determinar si el compte ha caducat.

source: ldap_access_order (string)
ca_es: ldap_access_order (cadena)

source: Comma separated list of access control options. Allowed values are:
ca_es: Llista separada per comes d'opcions de control d'accés. Els valors permesos són:

source: <emphasis>filter</emphasis>: use ldap_access_filter
ca_es: <emphasis>filter</emphasis>: utilitza ldap_access_filter

source: <emphasis>expire</emphasis>: use ldap_account_expire_policy
ca_es: <emphasis>expire</emphasis>: utilitza ldap_account_expire_policy

source: <emphasis>authorized_service</emphasis>: use the authorizedService attribute to determine access
ca_es: <emphasis>authorized_service</emphasis>: utilitza l'atribut authorizedService per determinar l'accés

source: Default: filter
ca_es: Per defecte: filter

source: Please note that it is a configuration error if a value is used more than once.
ca_es: Si us plau, tingueu en compte que és un error de configuració si un valor s'utilitza més d'una vegada.

source: ldap_deref (string)
ca_es: ldap_deref (cadena)

source: Specifies how alias dereferencing is done when performing a search. The following options are allowed:
ca_es: Especifica com la eliminació de referències d'àlies es fa en realitzar una cerca. S'admeten les opcions següents:

source: <emphasis>never</emphasis>: Aliases are never dereferenced.
ca_es: <emphasis>never</emphasis>: les referències dels àlies mai són eliminades.

source: <emphasis>searching</emphasis>: Aliases are dereferenced in subordinates of the base object, but not in locating the base object of the search.
ca_es: <emphasis>searching</emphasis>: les referències dels àlies són eliminades en subordinats de l'objecte base, però no en la localització de l'objecte base de la cerca.

source: <emphasis>finding</emphasis>: Aliases are only dereferenced when locating the base object of the search.
ca_es: <emphasis>finding</emphasis>: les referències dels àlies són eliminades només en localitzar l'objecte base de la cerca.

source: <emphasis>always</emphasis>: Aliases are dereferenced both in searching and in locating the base object of the search.
ca_es: <emphasis>always</emphasis>: les referències dels àlies són eliminades tant en la recerca i en la localització de l'objecte base de la cerca.

source: Default: Empty (this is handled as <emphasis>never</emphasis> by the LDAP client libraries)
ca_es: Per defecte: Buit (això es tractarà com <emphasis>never</emphasis> per les llibreries client d'LDAP)

source: All of the common configuration options that apply to SSSD domains also apply to LDAP domains. Refer to the <quote>DOMAIN SECTIONS</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for full details. <placeholder type="variablelist" id="0"/>
ca_es: Totes les opcions comunes de configuració que s'apliquen als dominis SSD també s'apliquen als dominis LDAP. Referiu-vos a la secció <quote>SECCIONS DE DOMINI</quote> de la pàgina de manual de <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per a tots els detalls. <placeholder type="variablelist" id="0"/>

source: ADVANCED OPTIONS
ca_es: OPCIONS AVANÇADES

source: ldap_netgroup_search_base (string)
ca_es: ldap_netgroup_search_base (cadena)

source: ldap_user_search_base (string)
ca_es: ldap_user_search_base (cadena)

source: ldap_group_search_base (string)
ca_es: ldap_group_search_base (cadena)

source: These options are supported by LDAP domains, but they should be used with caution. Please include them in your configuration only if you know what you are doing. <placeholder type="variablelist" id="0"/>
ca_es: Aquestes opcions són suportades pels dominis LDAP però s'haurien de fer servir amb cura. Si us plau, afegiu-les a la vostra configuració només si sabeu el que estau fent. <placeholder type="variablelist" id="0"/>

source: The following example assumes that SSSD is correctly configured and LDAP is set to one of the domains in the <replaceable>[domains]</replaceable> section.
ca_es: L'exemple següent presuposa que l'SSSD està correctament configurat i l'LDAP està definit com a un dels dominis a la secció <replaceable>[domains]</replaceable>.

source: The descriptions of some of the configuration options in this manual page are based on the <citerefentry> <refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page from the OpenLDAP 2.4 distribution.
ca_es: Les descripcions d'algunes de les opcions de configuració en aquesta pàgina del manual es basen en la pàgina del manual <citerefentry>de <refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> de la distribució de OpenLDAP 2.4.

source: <productname>SSSD</productname> <orgname>The SSSD upstream - http://fedorahosted.org/sssd</orgname>
ca_es: <productname>SSSD</productname> <orgname>La font de l'SSSD - http://fedorahosted.org/sssd</orgname>

source: PAM module for SSSD
ca_es: Mòdul de PAM per SSSD

source: <command>pam_sss.so</command> is the PAM interface to the System Security Services daemon (SSSD). Errors and results are logged through <command>syslog(3)</command> with the LOG_AUTHPRIV facility.
ca_es: <command>pam_sss.so</command> és la interfície PAM pel System Security Services daemon (SSSD). Els errors i els resultats es registren a través de <command>syslog(3)</command> amb el canal LOG_AUTHPRIV.

source: If <option>forward_pass</option> is set the entered password is put on the stack for other PAM modules to use.
ca_es: Si s'estableix <option>forward_pass</option> contrasenya introduïda és posa a la pila per tal que altres mòduls PAM l'utilitzin.

source: The argument use_first_pass forces the module to use a previous stacked modules password and will never prompt the user - if no password is available or the password is not appropriate, the user will be denied access.
ca_es: L'argument use_first_pass força al mòdul a utilitzar una contrasenya apliada als mòduls anteriors i mai demanarà l'usuari - si no hi ha cap contrasenya o la contrasenya no és correcte, se li negarà l'accés a l'usuari.

source: When password changing enforce the module to set the new password to the one provided by a previously stacked password module.
ca_es: Quan el canvi de contrasenya força al mòdul a establir la contrasenya nova a la proporcionada per un mòdul de contrasenya prèviament apilat.

source: If specified the user is asked another N times for a password if authentication fails. Default is 0.
ca_es: Si s'especifica l'usuari serà demanat N vegades més per una contrasenya en cas de fallar l'autenticació. Per defecte és 0.

source: Please note that this option might not work as expected if the application calling PAM handles the user dialog on its own. A typical example is <command>sshd</command> with <option>PasswordAuthentication</option>.
ca_es: Si us plau, tingueu en compte que aquesta opció podria no funcionar com s'espera si l'aplicació que crida PAM gestiona pel seu compte el diàleg amb l'usuari. Un exemple típic és <command>sshd</command> amb <option>PasswordAuthentication</option>.

source: MODULE TYPES PROVIDED
ca_es: MÒDUL TIPUS PROPORCIONATS

source: All module types (<option>account</option>, <option>auth</option>, <option>password</option> and <option>session</option>) are provided.
ca_es: S'ofereixen tots els tipus de mòdul (<option>compte</option>, <option>auth</option>, <option>contrasenya</option> i <option>sessió</option>).

source: If a password reset by root fails, because the corresponding SSSD provider does not support password resets, an individual message can be displayed. This message can e.g. contain instructions about how to reset a password.
ca_es: Si una contrasenya reinicialitzada per root falla, degut a que el proveïdor SSSD corresponent no suporta reinicialitzar contrasenyes, es pot mostrar un missatge concret. Aquest missatge pot contenir, per exemple, instruccions sobre com restaurar una contrasenya.

source: These files are searched in the directory <filename>/etc/sssd/customize/DOMAIN_NAME/</filename>. If no matching file is present a generic message is displayed.
ca_es: Aquests fitxers són buscat al directori <filename>/etc/sssd/customize/NOM_DE_DOMINI/</filename>. Si no es troba cap fitxer coincident es mostrarà un missatge genèric.

source: Not all Kerberos implementations support the use of plugins. If <command>sssd_krb5_locator_plugin</command> is not available on your system you have to edit /etc/krb5.conf to reflect your Kerberos setup.
ca_es: No totes les implementacions Kerberos suporten l'ús d'afegitons. Si <command>sssd_krb5_locator_plugin</command> no està disponible al seu sistema heu d'editar /etc/krb5.conf per reflectir la seva configuració de Kerberos.

source: the configuration file for SSSD's 'simple' access-control provider
ca_es: el fitxer de configuració per al proveïdor 'simple' de control d'accés d'SSSD

source: This manual page describes the configuration of the simple access-control provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
ca_es: Aquesta pàgina del manual descriu la configuració del proveïdor senzill de control d'accés per <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. Per una referència detallada de la sintaxi, aneu a la secció de <quote>FORMAT DE FITXER</quote> de la pàgina del manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The simple access provider grants or denies access based on an access or deny list of user or group names. The following rules apply:
ca_es: El proveïdor d'accés simple accepta o nega l'accés basat en una llista d'accés o denegació de noms d'usuari grups. S'apliquen les regles següents:

source: If all lists are empty, access is granted
ca_es: Si totes les llistes estan buides, s'accepta l'accés

source: If any list is provided, the order of evaluation is allow,deny. This means that any matching deny rule will supersede any matched allow rule.
ca_es: Si es proporciona alguna llista, l'ordre d'avaluació és accpetar, denegar. Això significa que qualsevol regla de denegació explícita substituirà qualsevol regla d'accés.

source: If either or both "allow" lists are provided, all users are denied unless they appear in the list.
ca_es: Si es proporcionen una o ambdues llistes d'acceptació tots els usuaris són denegats excepte els que apareixen a la llista.

source: If only "deny" lists are provided, all users are granted access unless they appear in the list.
ca_es: Si només es proporcionen llistes de "denegació" tots els usuaris tenen accés excepte els que apareixen a la llista.

source: simple_allow_users (string)
ca_es: simple_allow_users (cadena)

source: Comma separated list of users who are allowed to log in.
ca_es: Llista separada per comes d'usuaris amb permís per iniciar sessió.

source: simple_deny_users (string)
ca_es: simple_deny_users (cadena)

source: Comma separated list of users who are explicitly denied access.
ca_es: Llista separada per comes d'usuaris amb denegació explícita per iniciar sessió.

source: simple_allow_groups (string)
ca_es: simple_allow_groups (cadena)

source: Comma separated list of groups that are allowed to log in. This applies only to groups within this SSSD domain. Local groups are not evaluated.
ca_es: Llista separada per comes de grups que se'ls permet l'entrada. Això s'aplica només a grups d'aquest domini SSSD. No s'avaluen els grups locals.

source: simple_deny_groups (string)
ca_es: simple_deny_groups (cadena)

source: Comma separated list of groups that are explicitly denied access. This applies only to groups within this SSSD domain. Local groups are not evaluated.
ca_es: Llista separada per comes de grups que tenen l'accés explícitament denegat. Això s'aplica només a grups d'aquest domini SSSD. No s'avaluen els grups locals.

source: Refer to the section <quote>DOMAIN SECTIONS</quote> of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for details on the configuration of an SSSD domain. <placeholder type="variablelist" id="0"/>
ca_es: Consulteu la secció <quote>SECCIONS DE DOMINI</quote> de la pàgina del manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per a més informació sobre la configuració d'un domini SSSD. <placeholder type="variablelist" id="0"/>

source: Please note that it is an configuration error if both, simple_allow_users and simple_deny_users, are defined.
ca_es: Si us plau, tingueu en compte que és un error de configuració si es defineixen alhora simple_allow_users i simple_deny_users.

source: The following example assumes that SSSD is correctly configured and example.com is one of the domains in the <replaceable>[sssd]</replaceable> section. This examples shows only the simple access provider-specific options.
ca_es: L'exemple següent pressuposa que l'SSSD està configurat correctament i example.com és un dels dominis de la secció <replaceable>[sssd]</replaceable>. Aquest exemple mostra només les opcions d'accés simple específiques del proveïdor.
